/**
 * 打表从后往前贪心就好了,分析下就能知道每个数最多用一次
 */

class Solution {
    private int[] fibArray = {1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1597, 2584, 4181, 6765, 10946, 17711, 28657, 46368, 75025, 121393, 196418, 317811, 514229, 832040, 1346269, 2178309, 3524578, 5702887, 9227465, 14930352, 24157817, 39088169, 63245986, 102334155, 165580141, 267914296, 433494437, 701408733};

    public int findMinFibonacciNumbers(int k) {
        int ans = 0;
        for (int i = fibArray.length - 1; i >= 0 && k > 0; i--) {
            if (k >= fibArray[i]) {
                ans++;
                k -= fibArray[i];
            }
        }
        return ans;
    }
}